System Info:
	Python version: 3.6.13 |Anaconda, Inc.| (default, Mar 16 2021, 11:37:27) [MSC v.1916 64 bit (AMD64)]
	TensorFlow version: 1.11.0
	Keras version: 2.1.6-tf

Training Info:
	Loss Function: mean_absolute_error
	Optimisation Method: Adam
	Learning Rate: 0.001
	Batch Size: 128
	Number of Epochs: 100

Training Results:
	Loss: 0.10529935573925146
	Rse: 0.6330017252115764
	Corr: 0.40796685264867427

Validation Results:
	Loss: 0.12538825475944662
	Rse: 0.853346589826188
	Corr: 0.24396988303875022

Model Summary:
	__________________________________________________________________________________________________
	Layer (type)                    Output Shape         Param #     Connected to                     
	==================================================================================================
	input_1 (InputLayer)            (None, 24, 5)        0                                            
	__________________________________________________________________________________________________
	reshape (Reshape)               (None, 24, 5, 1)     0           input_1[0][0]                    
	__________________________________________________________________________________________________
	conv2d (Conv2D)                 (None, 21, 1, 50)    1050        reshape[0][0]                    
	__________________________________________________________________________________________________
	dropout (Dropout)               (None, 21, 1, 50)    0           conv2d[0][0]                     
	__________________________________________________________________________________________________
	reshape_1 (Reshape)             (None, 21, 50)       0           dropout[0][0]                    
	__________________________________________________________________________________________________
	pre_skip_trans (PreSkipTrans)   (None, 1, 50)        0           reshape_1[0][0]                  
	__________________________________________________________________________________________________
	gru (GRU)                       [(None, 50), (None,  15150       reshape_1[0][0]                  
	__________________________________________________________________________________________________
	gru_1 (GRU)                     [(None, 5), (None, 5 840         pre_skip_trans[0][0]             
	__________________________________________________________________________________________________
	dropout_1 (Dropout)             (None, 50)           0           gru[0][1]                        
	__________________________________________________________________________________________________
	post_skip_trans (PostSkipTrans) (None, 105)          0           gru_1[0][1]                      
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	pre_ar_trans (PreARTrans)       (None, 12)           0           input_1[0][0]                    
	__________________________________________________________________________________________________
	concatenate (Concatenate)       (None, 155)          0           dropout_1[0][0]                  
	                                                                 post_skip_trans[0][0]            
	__________________________________________________________________________________________________
	flatten_1 (Flatten)             (None, 12)           0           pre_ar_trans[0][0]               
	__________________________________________________________________________________________________
	flatten (Flatten)               (None, 155)          0           concatenate[0][0]                
	__________________________________________________________________________________________________
	dense_1 (Dense)                 (None, 1)            13          flatten_1[0][0]                  
	__________________________________________________________________________________________________
	dense (Dense)                   (None, 5)            780         flatten[0][0]                    
	__________________________________________________________________________________________________
	post_ar_trans (PostARTrans)     (None, 5)            0           dense_1[0][0]                    
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	add (Add)                       (None, 5)            0           dense[0][0]                      
	                                                                 post_ar_trans[0][0]              
	==================================================================================================
	Total params: 17,833
	Trainable params: 17,833
	Non-trainable params: 0
	__________________________________________________________________________________________________
